---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectContext3D.VertexFormatBits.PositionNormalColored
enum: Autodesk.Revit.DB.DirectContext3D.VertexFormatBits
source: html/e993d256-56d3-4103-3451-bb42bc90a7d8.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexFormatBits.PositionNormalColored

Vertex format consisting of a position, a normal vector, and a color.